package com.zhengtou.cf.api.pay.yibaoapi.enums;

/**
 * 易宝支付状态枚举
 * @author 葛文镇
 */
public enum  EnumPayStatus {
    CVN验证失败("TZ2010001"),
    CVV2或有效期有误("TZ2010002"),
    本卡在该商户不允许此交易("TZ2010003"),
    参数异常("TZ2010004"),
    超过商户日交易笔数("TZ2010005"),
    超过商户日交易限额("TZ2010006"),
    超过商户月交易笔数("TZ2010007"),
    持卡人认证失败a请重新核对信息("TZ2010008"),
    冲正成功("TZ2010009"),
    冲正异常("TZ2010010"),
    单日消费次数超限("TZ2010011"),
    短信验证码错误("TZ2010012"),
    短信验证码发送次数超限("TZ2010013"),
    短信验证码发送失败("TZ2010014"),
    短信验证码过期("TZ2010015"),
    该订单不支持退款("TZ2010016"),
    该卡不支持无卡支付("TZ2010017"),
    该卡超过商户限额("TZ2010018"),
    该客户号已关闭快速支付("TZ2010019"),
    交易超限a请联系发卡银行("TZ2010020"),
    交易受限("TZ2010021"),
    金额不能低于1元("TZ2010022"),
    卡信息或银行预留手机号有误("TZ2010023"),
    卡信息输入异常("TZ2010024"),
    卡信息验证未通过("TZ2010025"),
    卡种不支持("TZ2010026"),
    可用余额不足("TZ2010027"),
    密码错误次数超限a请联系发卡银行("TZ2010028"),
    密码验证失败a请重新输入("TZ2010029"),
    请您确认身份证件号是否填写正确("TZ2010030"),
    请求正在处理中("TZ2010031"),
    商户单笔金额超限("TZ2010032"),
    商户月累计金额超限("TZ2010033"),
    身份证号必须为18位("TZ2010034"),
    身份证或姓名有误("TZ2010035"),
    身份证与姓名不匹配("TZ2010036"),
    手机号码无记录("TZ2010037"),
    手机号为空("TZ2010038"),
    输入姓名有误("TZ2010039"),
    退款参数异常("TZ2010040"),
    退款金额超限("TZ2010041"),
    退款可退金额超限("TZ2010042"),
    退款已经存在不允许退款("TZ2010043"),
    未开通电子支付或交易信息有误("TZ2010044"),
    无效卡号a请核对重新输入("TZ2010045"),
    系统异常("TZ2010046"),
    消费金额超限("TZ2010047"),
    姓名为空("TZ2010048"),
    需要手机短验("TZ2010049"),
    一分钟内同一手机号校验过频繁a请稍后再试("TZ2010050"),
    银行处理中a请勿重复操作("TZ2010051"),
    银行卡异常a请联系发卡银行("TZ2010052"),
    银行退款失败("TZ2010053"),
    银行预留手机号有误("TZ2010054"),
    余额不足("TZ2010055"),
    预留手机号与开户行归属地不一致("TZ2010056"),
    原始金额不正确("TZ2010057"),
    账户异常("TZ2010058"),
    证件号码为空("TZ2010059"),
    支付记录不存在("TZ2010060"),
    支付失败a请稍候重试("TZ2010061"),
    重复的请求("TZ2010062"),
    验证码发送频率限制请稍候重试("TZ2010063"),
    订单已成功支付或者冲正请勿重复支付("TZ2010064"),
    超过支持的支付限额("TZ2010065");
    private String value;

    EnumPayStatus(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }

    public static EnumPayStatus getEnum(String value) {
        for (EnumPayStatus c : EnumPayStatus.values()) {
            if (c.getValue().equals(value)) {
                return c;
            }
        }
        return null;
    }

    public String toString(){
        return this.value;
    }
}
